app/Http/Controllers/front/AuthUserController.php

select count(*) as aggregate from `users` where `email` = 'tiendatvxhg@gmail.com'
insert into `users` (`name`, `email`, `phone`, `password`, `updated_at`, `created_at`) values ('quangdat', 'tiendatvxhg@gmail.com', '0344585983', '$2y$10$7.YNgZRAEZ8Kst3MNjrNLuUT6reYg0ki20cXTGCjhu3Wdni.VzWGa', '2024-04-09 21:02:16', '2024-04-09 21:02:16')
---
    public function post_register(Request $request)
    {
        $this->validate($request, [
            'name'  => 'required',
            'email' => 'required | email:rfc | email:strict',
            'phone' => 'required | numeric',
            'password' => 'required|confirmed|min:6',
        ]);

        if (User::where('email', $request->email)->count() != 0) {
            alert('Thất bại', 'Email này đã được sử dụng!', 'warning');
            return back();
        }

        $user = new User();
        $user->name = $request->name;
        $user->email = $request->email;
        $user->phone = $request->phone;
        $user->password = bcrypt($request->password);
        if ($user->save()) {