app/Http/Controllers/front/CartController.php

    public function add(cartHelper $cart, Request $request)
    {
        $product_id = $request->product_id;
        $size = $request->size;
        $qty = $request->qty;

        $pro = Product::where('id', $product_id)->first();
---
select * from `products` where `id` = '31' limit 1