app/Http/Controllers/front/CheckoutController.php

select * from `province`
---
    function index()
    {
        if (session('cart') != []) {
            $provinces = Province::all();

insert into `orders` (`user_id`, `name`, `email`, `phone`, `street_address`, `note`, `provincial`, `district`, `ward`, `payment_method`, `payment_status`, `status`, `updated_at`, `created_at`) values ('8', 'quangdat', 'tiendatvxhg@gmail.com', '0344585983', 'sdas', 'ádsadsda', 'Hà Giang', 'Huyện Vị Xuyên', '', 'momo_payment', 'unpaid', 'new', '2024-04-12 21:00:52', '2024-04-12 21:00:52')
---
    function order(cartHelper $cart, Request $request)
    {
        $this->validate($request, [
            'name' => 'required',
            'email' => 'required | email:rfc | email:strict',
            'phone'  => 'required | alpha_num',
            'street_address' => 'required',
            'note' => 'required | max: 500',
            'province' => 'required',
            'district' => 'required',
            'payment_method' => 'required',
        ]);
        $payment_status = 'unpaid';
        $status = 'new';
        if ($order = Order::create([
            'user_id' => $request->user_id,
            'name' => $request->name,
            'email' => $request->email,
            'phone' => $request->phone,
            'street_address' => $request->street_address,
            'note' => $request->note,
            'provincial' => $request->province_name,
            'district' => $request->district_name,
            'ward' => $request->ward_name,
            'payment_method' => $request->payment_method,
            'payment_status' => $payment_status,
            'status' => $status,
        ]))

insert into `order_details` (`order_id`, `product_id`, `size`, `qty`, `total`, `updated_at`, `created_at`) values (15, '27', '44', '1', 100000, '2024-04-13 08:52:21', '2024-04-13 08:52:21')
select * from `products` where `products`.`id` = '27' limit 1
update `products` set `qty` = `qty` - 1, `products`.`updated_at` = '2024-04-13 08:52:21' where `id` = 27
select * from `orders` where `orders`.`id` = 15 limit 1
update `orders` set `total` = 100000, `orders`.`updated_at` = '2024-04-13 08:52:21' where `id` = 15
---
                $qty = $item['qty'];
                $total = $item['price'] * $item['qty'];
                $main_total += $total;
                OrderDetail::create([
                    'order_id' => $order_id,
                    'product_id' => $item['product_id'],
                    'size' => $size,
                    'qty' => $qty,
                    'total' => $total,
                ]);
                Product::find($item['product_id'])->decrement('qty', $qty);
            }
            Order::find($order_id)->update([
                'total' => $main_total
            ]);

select * from `district` where `province_id` = '1'
---
    public function getDistricts($province_id)
    {
        $districts = District::where('province_id', $province_id)->get();

select * from `wards` where `district_id` = '3'
---
    public function getWards($district_id)
    {
        $wards = Ward::where('district_id', $district_id)->get();

select * from `orders` where `orders`.`id` = 15 limit 1
update `orders` set `payment_status` = 'paid', `orders`.`updated_at` = '2024-04-13 08:52:46' where `id` = 15
---

        if (isset($jsonResult['message']) && $jsonResult['message'] == "Thành công.") {
            $orderId = session('order_id');
            $order = Order::find($orderId);
            if ($order) {
                $order->payment_status = 'paid';
                $order->save();