app/Http/Controllers/front/HomeController.php

select * from `products` where `status` = 'active' order by `created_at` desc limit 8
select * from `slider` order by `created_at` desc
select * from `banner` where `status` = 'active' order by `created_at` desc
---
    public function index()
    {
        $products = Product::orderBy('created_at','DESC')->where('status','active' )->limit(8)->get();
        $slider = Slider::orderBy('created_at','DESC')->get();
        $banner = Banner::orderBy('created_at','DESC')->where('status','active' )->get();