app/Http/Controllers/front/OrderUserController.php

    public function order($id){
        $order = Order::where('user_id',$id)->orderBy('created_at', 'DESC')->paginate(10);
---
select * from `orders` where `user_id` = '8' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `orders` where `user_id` = '8'

    public function order_detail($id){
        $order = Order::findOrFail($id);
        $order_detail = OrderDetail::where('order_id', $id)->get();
---
select * from `orders` where `orders`.`id` = '11' limit 1
select * from `order_details` where `order_id` = '11'

    public function order_cancel(Request $request){
        $id = $request->id;
        Order::find($id)->update([
            'status' => 'order has been cancelled'
        ]);
        $orderDetail = OrderDetail::where('order_id', $id)->get();
        foreach ($orderDetail as $key => $value) {
            Product::find($value->product_id)->increment('qty', $value->qty);
---
select * from `orders` where `orders`.`id` = '11' limit 1
update `orders` set `status` = 'order has been cancelled', `orders`.`updated_at` = '2024-04-13 08:17:15' where `id` = 11
select * from `order_details` where `order_id` = '11'
select * from `products` where `products`.`id` = 3 limit 1
update `products` set `qty` = `qty` + 2, `products`.`updated_at` = '2024-04-13 08:17:15' where `id` = 3

    public function check_order(Request $request){

        $q = $request->q ?? '';
        $order = Order::where('email', 'like', '%'.$q. '%')->orWhere('phone', 'like', '%'.$q. '%')->orderBy('created_at', 'DESC')->paginate(10);
---
select * from `orders` where `email` like '%%' or `phone` like '%%' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `orders` where `email` like '%%' or `phone` like '%%'