app/Http/Controllers/front/Shop_detailsController.php

    function index($id)
    {
        $product_detail = Product::findOrFail($id);

        // Track hành vi xem sản phẩm
        UserBehavior::trackBehavior($id, UserBehavior::ACTION_VIEW);

        $productComments = ProductComment::where('product_id', $id)->orderBy('created_at', 'DESC')->get();

        // tính rating
        $avgRating = 0;
        $sumRating = array_sum(array_column($product_detail->productComments->toArray(), 'rating'));
        $countRating = count($product_detail->productComments);
        if ($countRating != 0) {
            $avgRating = $sumRating / $countRating;
        }

        //sản phẩm liên quan
        $relatedProducts = Product::where('product_category_id', $product_detail->product_category_id)
            ->whereNotIn('id', [$product_detail->id])
            ->limit(5)
            ->distinct()
            ->get();
---
select * from `products` where `products`.`id` = '33' limit 1
select * from `product_comments` where `product_id` = '33' order by `created_at` desc
select distinct * from `products` where `product_category_id` = 3 and `id` not in (33) limit 5