app/Http/Controllers/front/ShopController.php

select * from `product_categories`
select * from `products` where `name` like '%%' and `status` = 'active' order by `created_at` desc, `created_at` desc limit 9 offset 0
select count(*) as aggregate from `products` where `name` like '%%' and `status` = 'active'
---
    public function index(Request $request)
    {
        $search = $request->search ?? '';
        $products = Product::where('name', 'like', '%'  . $search . '%');
        $products = $this->filter($products, $request);
        $sort_by = $request->sort_by ?? 'new-product';
        switch ($sort_by) {
            case 'new-product':
                $products = $products->orderBy('created_at', 'DESC');
                break;
            case 'old-product':
                $products = $products->orderBy('created_at', 'ASC');
                break;
            case 'name-ascending':
                $products = $products->orderBy('name');
                break;
            case 'name-descending':
                $products = $products->orderByDesc('name');
                break;
            case 'price-ascending':
                $products = $products->orderBy('price');
                break;
            case 'price-descending':
                $products = $products->orderBy('price', 'DESC');
                break;
            default:
        };

        $categories = ProductCategory::get();

        $products = $products->where('status', 'active')->orderBy('created_at', 'DESC')->paginate(9);