app/Helpers/cartHelper.php

select * from `products` where `products`.`id` = '31' limit 1
---
    public function add($product_id, $size = '', $qty = 1)
    {
        $product = Product::findOrFail($product_id);