app/Helpers/showCategoriesHelper.php

select count(*) as aggregate from `products` inner join `product_categories` on `products`.`product_category_id` = `product_categories`.`id` where `product_categories`.`parent_id` = 1 and `status` = 'active'
select count(*) as aggregate from `products` inner join `product_categories` on `products`.`product_category_id` = `product_categories`.`id` where `product_categories`.`id` = 1 and `status` = 'active'
---
    public static function showCategories($categories, $parent_id = 0, $char = '')
    {
        foreach ($categories as $key => $item) {
            // Nếu là chuyên mục con thì hiển thị

            //count
            $countProducts = Product::join('product_categories', 'products.product_category_id', '=', 'product_categories.id')
                ->select('products.*', 'product_categories.parent_id')
                ->where('product_categories.parent_id', $item->id)
                ->where('status', 'active')
                ->count();

            $countSubcategory =  Product::join('product_categories', 'products.product_category_id', '=', 'product_categories.id')
                ->select('products.*', 'product_categories.parent_id')
                ->where('product_categories.id', $item->id)
                ->where('status', 'active')
                ->count();