app/Http/Controllers/Admin/DashboardController.php

select * from `orders` where `status` = 'new'
select * from `orders` where `status` = 'order has been cancelled'
select count(*) as aggregate from `users`
select SUM(total) as totalMoney from `orders` where `status` = 'delivered' and month(`created_at`) = '04'
select SUM(total) as totalMoney from `orders` where `status` = 'delivered' and year(`created_at`) = 2024
select SUM(total) as totalMoney, DATE(created_at) day from `orders` where `status` = 'delivered' and month(`created_at`) = '04' group by `day`
---
    public function index()
    {
        $listDay = dateHelper::getListDayInMonth();
        $new_order = Order::where('status', 'new')->get()->count();
        $order_has_been_cancelled = Order::where('status', 'order has been cancelled')->get()->count();
        $users = User::count();

        //tổng doanh thu tháng
        $thisMonth = Carbon::now()->month;
        $revenueMonth = Order::where('status', 'delivered')
            ->selectRaw('SUM(total) as totalMoney')
            ->whereMonth('created_at', $thisMonth)
            ->get()->toArray();
        //tổng doanh thu năm
        $thisYear = Carbon::now()->year;
        $revenueYear = Order::where('status', 'delivered')
            ->selectRaw('SUM(total) as totalMoney')
            ->whereYear('created_at', $thisYear)
            ->get()->toArray();
        // doanh thu tháng
        $revenue = Order::Where('status', 'delivered')
            ->selectRaw('SUM(total) as totalMoney')
            ->whereMonth('created_at', date('m'))
            ->selectRaw('DATE(created_at) day')
            ->groupBy('day')
            ->get()->toArray();

select products.*,orders.status,SUM(order_details.qty) as sum from `order_details` inner join `products` on `order_details`.`product_id` = `products`.`id` inner join `orders` on `order_details`.`order_id` = `orders`.`id` where `orders`.`status` = 'delivered' group by `products`.`id`, `products`.`name`, `products`.`slug`, `products`.`product_category_id`, `products`.`images`, `products`.`description`, `products`.`content`, `products`.`price`, `products`.`size`, `products`.`qty`, `products`.`discount`, `products`.`status`, `products`.`created_at`, `products`.`updated_at`, `orders`.`status` order by `sum` desc
select name,email,phone, COUNT(phone) as count from `orders` where `status` = 'delivered' group by `name`, `email`, `phone` order by `count` desc
select COUNT(id) as total_order, DATE(created_at) day from `orders` where month(`created_at`) = '04' and `status` = 'delivered' group by `day`
---
        //top 10 sản phẩm bán chạy
        $selling_products = OrderDetail::join('products', 'order_details.product_id', '=', 'products.id')
            ->join('orders', 'order_details.order_id', '=', 'orders.id')
            ->selectRaw('products.*,orders.status,SUM(order_details.qty) as sum')
            ->where('orders.status', 'delivered')
            ->groupBy(
                'products.id',
                'products.name',
                'products.slug',
                'products.product_category_id',
                'products.images',
                'products.description',
                'products.content',
                'products.price',
                'products.size',
                'products.qty',
                'products.discount',
                'products.status',
                'products.created_at',
                'products.updated_at',
                'orders.status'
            )
            ->orderBy('sum', 'DESC')
            ->get();

        //top khách hàng mua nhiều nhất
        $customers_buy_the_most = Order::selectRaw('name,email,phone, COUNT(phone) as count')
            ->where('status', 'delivered')
            ->groupBy('name', 'email', 'phone')
            ->orderBy('count', 'DESC')
            ->get();

        // đơn hàng đã hoàn thành theo tháng
        $total_order = Order::selectRaw('COUNT(id) as total_order')
            ->whereMonth('created_at', date('m'))
            ->where('status', 'delivered')
            ->selectRaw('DATE(created_at) day')
            ->groupBy('day')
            ->get()->toArray();

select COUNT(id) as total_order, DATE(created_at) day from `orders` where month(`created_at`) = '04' and `status` = 'order has been cancelled' group by `day`
---
            $arrTotal_order[] = (int)$total;
        }
       // đơn hàng đã hủy
        $total_order_has_been_cancelled = Order::selectRaw('COUNT(id) as total_order')
            ->whereMonth('created_at', date('m'))
            ->where('status', 'order has been cancelled')
            ->selectRaw('DATE(created_at) day')
            ->groupBy('day')
            ->get()->toArray();