app/Http/Controllers/Admin/OrderController.php

    function index(Request $request)
    {
        $order = Order::orderBy('status', 'ASC')->get();
---
select * from `orders` order by `status` asc

    function detail($id)
    {
        $order = Order::findOrFail($id);
        $order_detail = OrderDetail::where('order_id', $id)->get();
---
select * from `orders` where `orders`.`id` = '6' limit 1
select * from `order_details` where `order_id` = '6'